РП/src/Enums/СпособыПолучениеМатериаловЭтапаПроизводства/СпособыПолучениеМатериаловЭтапаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПолучениеМатериаловЭтапаПроизводства</name>
  <enumValues>
    <name>ЗаказатьНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПроизвестиПоСпецификации</name>
  </enumValues>
  <enumValues>
    <name>ИзПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ПроизвестиНаЭтапе</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/СпособыПолучениеМатериаловЭтапаПроизводства/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипНоменклатуры") И Параметры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		Если Параметры.Свойство("ДляЗаказа") Тогда
			ДанныеВыбора.Добавить(Перечисления.СпособыПолучениеМатериаловЭтапаПроизводства.ПроизвестиПоСпецификации, НСтр("ru='по спецификации';uk='по специфікації'"));
		Иначе	
			ДанныеВыбора.Добавить(Перечисления.СпособыПолучениеМатериаловЭтапаПроизводства.ПроизвестиПоСпецификации);
			ДанныеВыбора.Добавить(Перечисления.СпособыПолучениеМатериаловЭтапаПроизводства.ИзПодразделения);
		КонецЕсли; 
		
	ИначеЕсли Параметры.Свойство("ДляЗаказа") Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.СпособыПолучениеМатериаловЭтапаПроизводства.ПроизвестиПоСпецификации, НСтр("ru='по спецификации';uk='по специфікації'"));
		ДанныеВыбора.Добавить(Перечисления.СпособыПолучениеМатериаловЭтапаПроизводства.ПроизвестиНаЭтапе, НСтр("ru='на этапе';uk='на етапі'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
